interactiveprogramming.tex
% Created 2015-09-18 ו' 11:44
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\ifdefined\DeclareUnicodeCharacter{\DeclareUnicodeCharacter{00A0}{~}\DeclareUnicodeCharacter{002009}{\,}}\fi
\author{Daniel Szmulewicz}
\date{\today}
\title{Interactive programming}
\hypersetup{
 pdfauthor={Daniel Szmulewicz},
 pdftitle={Interactive programming},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.1)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Introduction}
\label{sec:orgheadline18}
\subsection*{A little quiz for starters}
\label{sec:orgheadline1}
Pieter is looking at Mieke, and Mieke is looking at Jan. Pieter is married, but Jan is not. Is a married person looking at an unmarried person?
\begin{itemize}
\item A. Yes
\item B. No
\item C. There is not enough information to derive the correct answer.
\end{itemize}
\subsection*{Evolution}
\label{sec:orgheadline2}
The human brain is wired to accept the first seemingly fit answer that comes to mind when considering a problem.
It makes sense from an evolutionary point of view: heuristics speed up the process of finding a solution. Speed is important for survival.
\subsection*{Reasoning and Logic}
\label{sec:orgheadline3}
\begin{quote}
Psychologists concur with philosophers in the irrelevance of logic to everyday reasoning. Decades of work on Wason’s selection task seem to confirm this. — Pascal Engels
\end{quote}
\subsection*{Thinking, Fast and Slow}
\label{sec:orgheadline4}
Following Daniel Kahneman’s terminology, the brain works in two modes, system 1 and system 2. System 1 is the thinking that is fast, intuitive, and unaware of its workings. System 2 is the slow thinking able to correct system 1’s mistakes. The problem is that we often fail to recognize when we need to switch gear and slow down. 
\subsection*{So, programming are we?}
\label{sec:orgheadline5}
Question: When we program, do we use system 1 or system 2?
We use both. When we learn or face a difficult part of the program, we use system 2, but most of the time we’ll try to maximize system 1 and proceed fast to use what we’ve learnt, what we already know.
\subsection*{Acceptance}
\label{sec:orgheadline6}
\begin{quote}
Civilization advances by extending the number of important operations which we can perform without thinking about them — Alfred North Whitehead
\end{quote}
\subsection*{Epistemological pluralism}
\label{sec:orgheadline7}
We need to be humble in the light of our shortcomings, and embrace any strategy that helps us exercice our capabilities. 
Constructionism. Seminal paper: \href{http://www.papert.org/articles/EpistemologicalPluralism.html}{Epistemological Pluralism and the Revaluation of the Concrete}, by Seymour Papert and Sherry Turkle
\subsection*{Methodology}
\label{sec:orgheadline9}
Desirable properties such as:
\begin{itemize}
\item testability
\item reactivity
\item incrementality
\item immediacy
\end{itemize}
\subsubsection*{Why interactive programming?}
\label{sec:orgheadline8}
\begin{itemize}
\item bottom-up programming
\item domain exploration
\item bricolage and prototyping
\item Bret Victor
\item ideal fit for innovation, learning and teaching
\end{itemize}

\subsection*{A definition}
\label{sec:orgheadline11}

Interactive programming is the procedure of writing parts of a program while it is already active.

From within the environment provided by the REPL, you can define and redefine program elements such as variables, functions, classes, and methods; evaluate any Lisp expression; load files containing Lisp source code or compiled code; compile whole files or individual functions; enter the debugger; step through code; and inspect the state of individual Lisp objects.

\subsubsection*{How do you build a story for interactive programming?}
\label{sec:orgheadline10}
\begin{itemize}
\item What properties must a programming language have to build a good story for interactive programming?
\end{itemize}

Consult a paper (from 1978): \href{http://www.ida.liu.se/ext/caisor/archive/1978/001/caisor-1978-001.pdf}{Programming in an Interactive Environment: the ``Lisp'' Experience} by Erik Sandewall
\begin{itemize}
\item Bootstrapping
\item Incrementality
\item Procedure orientation
\item Internal representation of programs
\item Full checking capability
\item Declaration-free kernel
\item Data structures and database
\item Defined I/O for data structure
\item Handles and interactive control
\end{itemize}

The kernel of the programming system must contain the following programs:

\begin{itemize}
\item a parser
\item a program-printer
\item an interpreter and/or
\item a compiler
\end{itemize}

\subsection*{The REPL}
\label{sec:orgheadline12}
\begin{verbatim}
(loop (print (eval (read))))
\end{verbatim}
\subsection*{Functionality of a Lisp REPL}
\label{sec:orgheadline15}
\begin{itemize}
\item History of inputs and outputs.
\item Variables for last result, last error (*1, *e).
\item Help and documentation for commands. (\texttt{doc}, \texttt{source} in clojure.repl namespace)
\item Variables to control the reader. (\texttt{*data-readers*}, \texttt{*default-data-reader-fn*})
\item Variables to control the printer. (\texttt{*print-length*}, \texttt{*print-level*})
\end{itemize}
\subsubsection*{How is a Lisp REPL different from any other REPL?}
\label{sec:orgheadline13}

\begin{itemize}
\item SO: \href{http://stackoverflow.com/questions/5671214/is-lisp-the-only-language-with-repl}{Is Lisp the only language with REPL?}
\item Clearly not: \url{http://repl.it/}
\item Yet, Lisp’s story for interactive programming is unparalleled.
\end{itemize}

\subsubsection*{A REPL is not enough}
\label{sec:orgheadline14}
\begin{quote}
But for the true Lisp programming experience, you need an environment, such as SLIME, that lets you interact with Lisp both via the REPL and while editing source files. — \textbf{Peter Seibel}, Practical Common Lisp
\end{quote}
\begin{quote}
For instance, you don't want to have to cut and paste a function definition from a source file to the REPL or have to load a whole file just because you changed one function; your Lisp environment should let us evaluate or compile both individual expressions and whole files directly from your editor. — \textbf{Peter Seibel}, Practical Common Lisp
\end{quote}
\subsection*{The environment}
\label{sec:orgheadline17}
\subsubsection*{Types of environments}
\label{sec:orgheadline16}
\begin{center}
\begin{tabular}{ll}
Lisp & Non-Lisp\\
\hline
SLIME  (CL) & COLT (Actionscript)\\
Cider (Clojure & SuperCollider (C++)\\
Emacs (Lisp) & Squeak (Smalltalk)\\
Geiser (Scheme) & \\
Genera (Lisp Machine) & \\
\end{tabular}
\end{center}
\section*{Clojure}
\label{sec:orgheadline32}
Henceforth, the environment will be known as Cider.
\subsubsection*{Restarting the runtime}
\label{sec:orgheadline19}
You don’t want to do that. 
Clojure needs to bootstrap itself inside the JVM each and every time.
\subsubsection*{Restarting the application}
\label{sec:orgheadline20}
Ah. Let’s see.
\subsubsection*{Reloading the namespace}
\label{sec:orgheadline21}
Cojure built-in facilities: \texttt{(require ... :reload)} and \texttt{(require ... :reload-all)} 
Some problems.
\begin{itemize}
\item If you modify two namespaces which depend on each other, you must remember to reload them in the correct order to avoid compilation errors.
\item If you remove definitions from a source file and then reload it, those definitions are still available in memory. If other code depends on those definitions, it will continue to work but will break the next time you restart the JVM.
\item If the reloaded namespace contains defmulti, you must also reload all of the associated defmethod expressions.
\item If the reloaded namespace contains defprotocol, you must also reload any records or types implementing that protocol and replace any existing instances of those records/types with new instances.
\item If the reloaded namespace contains macros, you must also reload any namespaces which use those macros.
\item If the running program contains functions which close over values in the reloaded namespace, those closed-over values are not updated. (This is common in web applications which construct the "handler stack" as a composition of functions.)
\end{itemize}
\subsubsection*{tools.namespace}
\label{sec:orgheadline22}
Solved by tools.namespace single API call \texttt{refresh}.
The \texttt{refresh} function will scan all the directories on the classpath for Clojure source files, read their ns declarations, build a graph of their dependencies, and load them in dependency order. (You can change the directories it scans with set-refresh-dirs.)
But first, it will unload (remove) the namespaces that changed to clear out any old definitions.
\begin{verbatim}
user=> (require '[clojure.tools.namespace.repl :refer [refresh]])
user=> (refresh)
user=> (def my-app (start-my-app))
\end{verbatim}
\begin{verbatim}
user=> (stop-my-app my-app)
user=> (refresh)
user=> (def my-app (start-my-app))
\end{verbatim}
\subsection*{So, is that it?}
\label{sec:orgheadline30}
\begin{itemize}
\item No global state. \texttt{refresh} will destroy Vars when it reloads the namespace (even \texttt{defonce})
\item Acquiring and releasing resources (sockets, files, database connections)
\end{itemize}
\subsubsection*{The Reloaded pattern}
\label{sec:orgheadline23}
\texttt{tools.namespace} + Lifecycle protocol (Stuart Sierra)
\url{http://thinkrelevance.com/blog/2013/06/04/clojure-workflow-reloaded}
\subsubsection*{component}
\label{sec:orgheadline24}
\texttt{component} is a tiny Clojure framework for managing the lifecycle of software components which have runtime state. 
\subsubsection*{system}
\label{sec:orgheadline25}
A set of readymade components. The usual suspects.
\begin{center}
\begin{tabular}{ll}
Jetty & Datomic\\
HTTP kit & H2\\
Aleph & Monger\\
Sente & nREPL\\
Neo4j & Langohr\\
ElasticSearch & PostgreSQL\\
Immutant & Etsy\\
\end{tabular}
\end{center}
\subsubsection*{Leiningen}
\label{sec:orgheadline26}
JVM instances proliferation. Examples: the REPL, the \texttt{cljs} build, the hot-reloading process (figwheel), preprocessors, watchers\ldots{}.

In shell a:
\begin{verbatim}
$ lein repl :headless
\end{verbatim}
In shell b:
\begin{verbatim}
$ lein trampoline cljsbuild repl-listen
\end{verbatim}
Or:
\begin{verbatim}
$ lein figwheel
\end{verbatim}
\subsubsection*{Boot}
\label{sec:orgheadline27}
Single JVM instance.
\begin{verbatim}
(deftask dev
  "Run a restartable system in the Repl"
  []
  (comp
   (watch :verbose true)  
   (reload) ; figwheel
   (cljs :source-map true) ; cljsbuild
   (repl :server true))) ; REPL
\end{verbatim}
\subsubsection*{Anatomy of a system}
\label{sec:orgheadline28}
\begin{verbatim}
(defsystem dev-system
  [:db (new-h2-database DEFAULT-MEM-SPEC)
   :web (new-web-server (Integer. (env :http-port)) app)])
\end{verbatim}
\subsubsection*{Boot-system}
\label{sec:orgheadline29}
\begin{verbatim}
(deftask dev
  "Run a restartable system in the Repl"
  []
  (comp
   (environ :env {:http-port "3025"
		  :imdb-key "xxxxx-xxxx-xxxxx-xxxxx"})
   (watch :verbose true)
   (system :sys #'dev-system :auto-start true :hot-reload true :files ["handler.clj"])
   (reload) ; equivalent to figwheel
   (cljs :source-map true) ; equivalent to cljsbuild
   (repl :server true)))
\end{verbatim}
\url{https://github.com/danielsz/system#boot-system}
\subsection*{CQFD}
\label{sec:orgheadline31}
Your application updates itself automatically when editing your source code.
\begin{itemize}
\item \texttt{(require ... :reload)}
\item \texttt{(refresh\}} (via \texttt{(reloaded.repl/reset)})
\end{itemize}
\section*{Reference}
\label{sec:orgheadline38}
\subsection*{A history of interactive programming}
\label{sec:orgheadline33}

\url{http://ecx.images-amazon.com/images/I/51qjJtCFxiL.jpg}

\subsection*{GUIs and interactive environments}
\label{sec:orgheadline34}
\url{http://upload.wikimedia.org/wikipedia/en/d/d2/Symbolics-document-examiner.png}
Garnet - a graphical toolkit for Lisp
\subsection*{Live coding}
\label{sec:orgheadline35}
Live coding performance in Impromptu by Andrew Sorensen.
\subsection*{A REPL Everywhere}
\label{sec:orgheadline36}
Full Clojure programming environment in Microsoft Excel
\url{https://github.com/whamtet/Excel-REPL}
\subsection*{The ultimate interactive session}
\label{sec:orgheadline37}
\end{document}
